RIET/src/Documents/РегламентированныйОтчет/РегламентированныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегламентированныйОтчет</name>
  <comment>(Общ)</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Вид</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчетности</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбраннаяФорма</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОтчета</name>
    <comment>(Общ) Сохраненные данные отчета</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <comment>(Общ) Дата подписи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоНастройкиСтраниц</name>
    <comment>(Общ) Дерево со списком настроек страниц</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОтчета</name>
    <comment>(Общ) Имя встроенной или имя файла внешней обработки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОрганаПосредника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОтчета</name>
    <comment>(Общ) Наименование регламентированного отчета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <comment>(Общ) Периодичность представления отчета</comment>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьЕдиницыИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/ВыгрузкаРегламентированныхОтчетов/ВыгрузкаРегламентированныхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыгрузкаРегламентированныхОтчетов</name>
  <registerRecords>InformationRegister.АрхивДанныхРегламентированнойОтчетности</registerRecords>
  <attributes>
    <name>ПериодПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоНалоговомуОргану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Основная</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.РегламентированныйОтчет</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТекстаВыгрузки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выгрузки</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ВерсииФорматовВыгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/РегламентированныйОтчет/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем мЭтоНовый;

#Область ОбработчикиСобытийМодуляОбъекта

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мЭтоНовый = ЭтоНовый();
	
	Период = СокрЛП(Формат(ДатаОкончания, "ДФ=yyyyMMdd") + Формат('39991231' - ДатаНачала, "ДФ=yyyyMMdd"));
	
	Если Периодичность = Перечисления.Периодичность.Месяц Тогда
	
		ПредставлениеПериода = РегламентированнаяОтчетностьВызовСервера.ПредставлениеФинансовогоПериода(ДатаНачала, ДатаОкончания, "Ложь");
		
	Иначе	
		
		ПредставлениеПериода = РегламентированнаяОтчетностьВызовСервера.ПредставлениеФинансовогоПериода(ДатаНачала, ДатаОкончания);
		
	КонецЕсли;
		
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|   ВыгрузкаРегламентированныхОтчетов.Ссылка
	|ИЗ
	|	Документ.ВыгрузкаРегламентированныхОтчетов.Основная КАК ВыгрузкаРегламентированныхОтчетов
	|ГДЕ
	|	ВыгрузкаРегламентированныхОтчетов.Основание.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	ДокументыВыгрузки = Запрос.Выполнить().Выгрузить();
	
	Если ДокументыВыгрузки.Количество() > 0 Тогда
		
		НачатьТранзакцию();
		
		Для Каждого ДокВыгрузки Из ДокументыВыгрузки Цикл
			
			ДокВыгрузки = ДокВыгрузки.Ссылка.ПолучитьОбъект();
			
			ДокВыгрузки.Заблокировать();
			
			Если ЭтотОбъект.ПометкаУдаления Тогда
				
				Колво = ДокВыгрузки.Основная.Количество();
				
				Если Колво > 1 Тогда
					
					Для Ном = 1 По Колво Цикл
						
						Если ДокВыгрузки.Основная.Получить(Колво - Ном).Основание.Ссылка = ЭтотОбъект.Ссылка Тогда
							ДокВыгрузки.Основная.Удалить(Колво - Ном);
						КонецЕсли;
						
					КонецЦикла;
					
					ДокВыгрузки.Записать(РежимЗаписиДокумента.Запись);
					
				Иначе
					
					ДокВыгрузки.УстановитьПометкуУдаления(Истина);
					
				КонецЕсли;
				
			Иначе	
				
				ДокВыгрузки.УстановитьПометкуУдаления(Ложь);
				
				ДокВыгрузки.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
									
			ДокВыгрузки.Разблокировать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если мЭтоНовый Тогда
		РегламентированнаяОтчетность.ОбработатьСобытие1СОтчетности(НСтр("ru = 'Регламентированный отчет. Создание'"), ЭтотОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
